Revit 2026 API

# RoomLimitOffset Property

---

Get or Set the Limit Offset of the Room.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double LimitOffset { get; set; }
```
```vb
Public Property LimitOffset As Double
	Get
	Set
```
```cpp
public:
property double LimitOffset {
	double get ();
	void set (double value);
}
```
```fsharp
member LimitOffset : float with get, set
```

#### Property Value

Double

This property is used to get or set the Limit Offset of the Room.

#### Reference

Room Class

Autodesk.Revit.DB.Architecture Namespace